
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Веб-сайт технической поддержки</title>
</head>
<body>
    <div align="center">
        <h3>Добро пожаловать на сайт технической поддержки!</h3>
        <button><a href="../IDOR/tickets.php">Отправить сообщение об ошибке в тех. поддержку</a></button>
        <button><a href="../IDOR/login">Войти</a></button>
        <button><a href="../IDOR/register">Зарегаться</a></button>

    </div>

    <div align="justify">Прохождение<br>
Шаг 1: Понимание работы приложения<br>
Начните с изучения работы приложения и того, как оно обрабатывает запросы. Найдите места, где происходит обращение к объектам или данным, используя идентификаторы.

<br>Шаг 2: Поиск уязвимости<br>
Найдите параметры запроса или URL, которые могут быть изменены для доступа к объектам или данным других пользователей или защищенных ресурсов.

<br>Шаг 3: Эксплуатация уязвимости<br>
Измените параметры запроса или URL, чтобы получить доступ к объектам или данным, к которым у вас нет доступа. Обратите внимание на изменения в поведении приложения и получение конфиденциальных данных.

<br>Шаг 4: Получение флага<br>
Как только вы успешно получите доступ к защищенным объектам или данным, найдите способ получить флаг, который может быть скрыт в них. Флаг представлен в формате "CTF{...}".<br>

    </div>
<br><br><div align="left"><a href="http://127.0.0.1:8000/CaptureTF/lessons">к заданиям</a></div>

</body>
</html>
